update appunti
